months_list = ["январь", "февраль", "март", "апрель", "май", "июнь", "июль", "август", "сентябрь", "октябрь", "ноябрь",
               "декабрь"]

months_dict = {1: "январь",
               2: "февраль",
               3: "март",
               4: "апрель",
               5: "май",
               6: "июнь",
               7: "июль",
               8: "август",
               9: "сентябрь",
               10: "октябрь",
               11: "ноябрь",
               12: "декабрь"
               }

user_month = int(input("Введите месяц в виде целого числа от 1 до 12: "))
print(months_list[user_month - 1])
print(months_dict[user_month])
